In [1]:
import pandas as pd 
import numpy as np

In [2]:
df= pd.read_csv("D:\IMP DOC\Data-cleaning-for-beginners-using-pandas.csv")

In [3]:
df.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [4]:
df.tail()

    Index   Age     Salary  Rating       Location  Established Easy Apply
24     24  13.0  $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0  $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN  $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0  $44k-$99k     5.4       India,In         1935         -1
28     28   NaN  $39k-$88k     3.4  Australia Aus         1932         -1

In [5]:
df.shape

(29, 7)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        29 non-null     int64
 1   Age          22 non-null     float64
 2   Salary       29 non-null     object
 3   Rating       28 non-null     float64
 4   Location     29 non-null     object
 5   Established  29 non-null     int64
 6   Easy Apply   29 non-null     object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.7+ KB

In [7]:
# null values
df.isnull().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [8]:
print("total number of null values in data: ", df.isnull().sum().sum())

total number of null values in data:  8

In [9]:
# fix columns 
df.columns

Index(['Index', 'Age', 'Salary', 'Rating', 'Location', 'Established',
       'Easy Apply'],
      dtype='object')

In [10]:
df.columns = df.columns.str.lower().str.replace(" ", "_")
df.columns

Index(['index', 'age', 'salary', 'rating', 'location', 'established',
       'easy_apply'],
      dtype='object')

In [11]:
# fixing Age
print(df.age.mean())
df['age']= df.age.fillna(df.age.mean())
df['age']= df.age.round(decimals=1)
print(df.age.isnull().sum())

39.04545454545455
0

In [12]:
df.head()

   index   age     salary  rating       location  established easy_apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2  39.0  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [13]:
# Clean established column
df["established"] = df["established"].replace(-1,np.nan)
df["established"].fillna('unknown', inplace=True)

In [14]:
#location column
df.location.astype

<bound method NDFrame.astype of 0          India,In
1       New York,Ny
2       New York,Ny
3          India In
4     Australia Aus
5          India,In
6       New York,Ny
7     Australia Aus
8       New York,Ny
9          India,In
10         India,In
11         India,In
12         India,In
13    Australia Aus
14    Australia Aus
15    Australia Aus
16         India,In
17      New York,Ny
18      New York,Ny
19      New York,Ny
20      New York,Ny
21      New York,Ny
22      New York,Ny
23      New York,Ny
24      New York,Ny
25    Australia Aus
26         India,In
27         India,In
28    Australia Aus
Name: location, dtype: object>

In [15]:
df['location']= df['location'].str.replace("Australia Aus","Australia, Aus")
df['location_city'] = df['location'].str.split(",", expand=True).get(0)
df['city_sign'] = df['location'].str.split(",", expand=True).get(1)
df.drop('location', inplace=True, axis=1)

In [16]:
#rating column
df['rating'] = df["rating"].replace(-1,np.nan)

df['rating']= df["rating"].fillna(df['rating'].mean()).round(decimals=1)

In [17]:
# Easy Apply
df['easy_apply'] = df['easy_apply'].replace("-1","True")

In [18]:
#salary Column
df['salary'].iloc[0]

df['salary'] = df['salary'].apply(lambda x:x.replace("$",''))
df['salary'] = df['salary'].apply(lambda x:x.replace("k",''))

In [19]:
df

    index   age  salary  rating established easy_apply location_city city_sign
0       0  44.0   44-99     5.4      1999.0       TRUE         India        In
1       1  66.0   55-66     3.5      2002.0       TRUE      New York        Ny
2       2  39.0   77-89     4.3     unknown       True      New York        Ny
3       3  64.0   44-99     4.4      1988.0       True      India In      None
4       4  25.0   44-99     6.4      2002.0       True     Australia       Aus
5       5  44.0   77-89     1.4      1999.0       TRUE         India        In
6       6  21.0   44-99     0.0     unknown       True      New York        Ny
7       7  44.0   44-99     4.3     unknown       True     Australia       Aus
8       8  35.0   44-99     5.4     unknown       True      New York        Ny
9       9  22.0   44-99     7.7     unknown       TRUE         India        In
10     10  55.0   10-49     5.4      2008.0       TRUE         India        In
11     11  44.0   10-49     6.7      2009.0       True         India        In
12     12  39.0   44-99     0.0      1999.0       True         India        In
13     13  25.0   44-99     4.3      2019.0       TRUE     Australia       Aus
14     14  66.0   44-99     4.0      2020.0       TRUE     Australia       Aus
15     15  44.0  88-101     3.0      1999.0       True     Australia       Aus
16     16  19.0   19-40     4.5      1984.0       True         India        In
17     17  39.0   44-99     5.3      1943.0       TRUE      New York        Ny
18     18  35.0   44-99     6.7      1954.0       TRUE      New York        Ny
19     19  32.0   44-99     3.3      1955.0       TRUE      New York        Ny
20     20  39.0   44-99     5.7      1944.0       TRUE      New York        Ny
21     21  35.0   44-99     5.0      1946.0       True      New York        Ny
22     22  19.0   55-66     7.8      1988.0       TRUE      New York        Ny
23     23  39.0   44-99     2.4      1999.0       TRUE      New York        Ny
24     24  13.0   44-99     4.3      1987.0       True      New York        Ny
25     25  55.0   44-99     0.0      1980.0       TRUE     Australia       Aus
26     26  39.0   55-66     4.3      1934.0       TRUE         India        In
27     27  52.0   44-99     5.4      1935.0       True         India        In
28     28  39.0   39-88     3.4      1932.0       True     Australia       Aus

In [20]:
      ##### Chipotle ####

In [21]:
import pandas as pd
import numpy as np

In [22]:
# loading data
df = pd.read_csv("D:\IMP DOC\chipotle.tsv",sep='\t')

In [23]:
# DATA OVERVIEW

In [24]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [25]:
df.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [26]:
df.shape

(4622, 5)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [28]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [ ]:
#### Questions ###

In [29]:
#1. quantity of each item
df['item_name'].value_counts()

Chicken Bowl                             726
Chicken Burrito                          553
Chips and Guacamole                      479
Steak Burrito                            368
Canned Soft Drink                        301
Steak Bowl                               211
Chips                                    211
Bottled Water                            162
Chicken Soft Tacos                       115
Chips and Fresh Tomato Salsa             110
Chicken Salad Bowl                       110
Canned Soda                              104
Side of Chips                            101
Veggie Burrito                            95
Barbacoa Burrito                          91
Veggie Bowl                               85
Carnitas Bowl                             68
Barbacoa Bowl                             66
Carnitas Burrito                          59
Steak Soft Tacos                          55
6 Pack Soft Drink                         54
Chips and Tomatillo Red Chili Salsa       48
Chicken Crispy Tacos                      47
Chips and Tomatillo Green Chili Salsa     43
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        35
Chips and Tomatillo-Green Chili Salsa     31
Steak Salad Bowl                          29
Nantucket Nectar                          27
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        22
Izze                                      20
Chips and Tomatillo-Red Chili Salsa       20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     11
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Veggie Soft Tacos                          7
Carnitas Crispy Tacos                      7
Veggie Salad                               6
Carnitas Salad Bowl                        6
Burrito                                    6
Steak Salad                                4
Crispy Tacos                               2
Salad                                      2
Bowl                                       2
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Carnitas Salad                             1
Name: item_name, dtype: int64

In [31]:
#2.What was the most ordered item in the choice_description column?

choice_counts = df['choice_description'].str.split(', ').explode().value_counts()

# Get the most ordered item
most_ordered_item = choice_counts.idxmax()
num_orders = choice_counts.max()

print(f"The most ordered item is '{most_ordered_item}' with {num_orders} orders.")

The most ordered item is 'Cheese' with 1887 orders.

In [32]:
#3.How many items were ordered in total

choice_counts = df['choice_description'].str.split(', ').explode().value_counts()

# Get the total number of items ordered
total_items_ordered = choice_counts.sum()

print(f"The total number of items ordered is {total_items_ordered}.")

The total number of items ordered is 15754.

In [33]:
#4.How much was the revenue for the period in the dataset?

df['item_price'] = df['item_price'].str.replace('$', '').astype(float)

# Calculate revenue for each item 
df['revenue'] = df['quantity'] * df['item_price']

# Sum  the revenue 
total_revenue = df['revenue'].sum()

print(f"The total revenue for the period is ${total_revenue:.2f}.")

The total revenue for the period is $39237.02.

C:\Users\ns118\AppData\Local\Temp\ipykernel_7904\1808836055.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['item_price'] = df['item_price'].str.replace('$', '').astype(float)

In [34]:
#5.How many orders were made in the period?
num_orders = df['order_id'].nunique()

print(f"The total number of orders made in the period is {num_orders}.")

The total number of orders made in the period is 1834.

In [36]:
#6.	What is the average revenue amount per order?
num_orders = df['order_id'].nunique()

average_revenue_per_order = total_revenue / num_orders

print(f"The average revenue amount per order is ${average_revenue_per_order:.2f}.")

The average revenue amount per order is $21.39.

In [37]:
#7.	How many different items are sold?

num_items_sold = df['item_name'].nunique()

print(f"The total number of different items sold is {num_items_sold}.")

The total number of different items sold is 50.